Rails/Assignment1/app/controllers/users_controller.rb

  def index
    @page = params.fetch(:page, 0).to_i
    if params[:search]
      @users_count = User.where('lower(first_name) LIKE ?', "%#{params[:search].downcase}%").count
      @users = User.where('lower(first_name) LIKE ?', "%#{params[:search].downcase}%").order(:id).offset(@page * USERS_PER_PAGE).limit(USERS_PER_PAGE)
    else
      @users_count = User.all.count
      @users = User.all.order(:id).offset(@page * USERS_PER_PAGE).limit(USERS_PER_PAGE)
---
SELECT COUNT(*) FROM "users" WHERE (lower(first_name) LIKE '%user%')
SELECT "users".* FROM "users" WHERE (lower(first_name) LIKE '%user%') ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (lower(first_name) LIKE '%b%')

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "gender", "about", "password", "country", "created_at", "updated_at", "email", "hobbies") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "hobbies" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-08 07:31:05.040604"], ["hobbies", "{Cooking}"], ["id", 1]]