Rails/rails-jwt/app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "rav01@gmail.com"], ["LIMIT", 1]]