Rails/rails-jwt/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ravi"], ["username", "ravi"], ["email", "rav01@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-07-11 12:33:10.365223"], ["updated_at", "2022-07-11 12:33:10.365223"]]
---
  def create
    @user = User.new(user_params)
    if @user.save