Rails/scheduled_tweets/app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    #flash.now[:notice] = "Logged in successfully"
    #flash.now[:alert] = "Invalid email or password"
    if session[:user_id]
      @user = User.find_by(id: session[:user_id])