Rails/scheduled_tweets/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "published_at", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @tweet = Current.user.tweets.new(tweet_params)
    if @tweet.save