Rails/scheduled_tweets/app/controllers/twitter_accounts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def destroy
    @twitter_account = Current.user.twitter_account.find(params[:id])