Rails/Rails 5.2.0/image_uploader/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "gender", "profile", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Ria"], ["gender", "Female"], ["profile", ""], ["address", "abc "], ["created_at", "2022-07-13 13:35:53.499779"], ["updated_at", "2022-07-13 13:35:53.499779"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE (name LIKE '%Ria%')
---
  def searching
    if params[:name]
      @users = User.where('name LIKE ?', "%#{params[:name]}%")