Rails/Rails 5.2.0/image_uploader/app/views/home/_partial.html.erb

<% User.all.each do |user| %>
---
SELECT "users".* FROM "users"