Rails/student-management/app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "Mona"], ["last_name", "Verma"], ["email", "mona@gmail.com"], ["created_at", "2022-06-27 08:04:13.927879"], ["updated_at", "2022-06-27 08:04:13.927879"]]

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "email" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Alex"], ["last_name", "Johns"], ["email", "alex1@gmail.com"], ["updated_at", "2022-06-27 09:02:27.558486"], ["id", 2]]