Rails/student-management/lib/tasks/active_record_counter.rake

  task students_count: :environment do
    puts"Student Count = #{Student.count}"
---
SELECT COUNT(*) FROM "students"