Rails/Library_mngmt_system/app/views/categories/new.html.erb

    <%= form.label :name, class: 'form-label' %><br />
    <%= form.select :name, ["Select"]+Category.pluck(:name) %>
---
SELECT "categories"."name" FROM "categories"


$('#category_name').change(function(){
        console.log("Category Selected or changed");
        $('#subcategory-div').show();

        category_subcategory_name = document.getElementById('category_subcategory_name');

       let category = category_name.options[category_name.selectedIndex].text;


        category_subcategory_name.innerHTML = "";
          <%Subcategory.all.each do |subcategory|%>
            if (category == '<%= subcategory.category.name %>')
 {            option = document.createElement("option");
             option.value = '<%= subcategory.id %>';
             option.text = '<%= subcategory.name %>';
             category_subcategory_name.appendChild(option);
}
          <% end %>
          option = document.createElement("option");
          option.value = option.text = 'SELECT';
          category_subcategory_name.appendChild(option);
---
SELECT "subcategories".* FROM "subcategories"