Rails/scheduled_tweets/app/controllers/Api/V1/twitter_accounts_controller.rb

    def index
      twitter_accounts = TwitterAccount.all
---
SELECT "twitter_accounts".* FROM "twitter_accounts"