Rails/Library_mngmt_system/app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO "authors" ("name", "created_at", "updated_at", "email", "gender") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Ruskin Bond"], ["created_at", "2022-08-01 14:31:25.621579"], ["updated_at", "2022-08-01 14:31:25.621579"], ["email", "ruskin@gmail.com"], ["gender", "Male"]]

  def update
    @author  = Author.find(params[:id])
    if @author.update(author_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "authors" SET "updated_at" = $1, "email" = $2, "gender" = $3 WHERE "authors"."id" = $4  [["updated_at", "2022-07-29 09:04:02.848775"], ["email", ""], ["gender", "Male"], ["id", 1]]

  def destroy
    @author = Author.find(params[:id])
    if @author.destroy
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 10]]