Rails/Library_mngmt_system/app/controllers/books_controller.rb

SELECT COUNT(*) FROM "books" WHERE (lower(title) LIKE '%cover%')
SELECT "books".* FROM "books" WHERE (lower(title) LIKE '%cover%') ORDER BY "books"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books" ORDER BY "books"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
  def index
    @page = params.fetch(:page, 0).to_i
    if params[:search]
      @books_count = Book.where('lower(title) LIKE ?', "%#{params[:search].downcase}%").count
      @books = Book.where('lower(title) LIKE ?', "%#{params[:search].downcase}%").order(:id).offset(@page * BOOKS_PER_PAGE).limit(BOOKS_PER_PAGE)
    else
      @books_count = Book.all.count
      @books = Book.all.order(:id).offset(@page * BOOKS_PER_PAGE).limit(BOOKS_PER_PAGE)

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "updated_at" = $1, "author_id" = $2 WHERE "books"."id" = $3  [["updated_at", "2022-07-29 09:01:27.316028"], ["author_id", 1], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)