Rails/Library_mngmt_system/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        @category = Category.all

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        @category = Category.includes(:subcategories).find(params[:id])