Rails/Library_mngmt_system/app/controllers/fines_controller.rb

  def index
    @fines = Fine.all
---
SELECT "fines".* FROM "fines"