Rails/Library_mngmt_system/app/controllers/fines_controller.rb

  def index
    @page = params.fetch(:page, 0).to_i
    if params[:search]
      @fines = Fine.where('lower(payment_status) LIKE ?', "%#{params[:search].downcase}%").order(:id).offset(@page * FINES_PER_PAGE).limit(FINES_PER_PAGE)
    else
      @fines_count = Fine.all.count
      @fines = Fine.all.order(:id).offset(@page * FINES_PER_PAGE).limit(FINES_PER_PAGE)
---
SELECT COUNT(*) FROM "fines" WHERE (lower(payment_status) LIKE '%false%')
SELECT COUNT(*) FROM "fines"
SELECT "fines".* FROM "fines" ORDER BY "fines"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]

  def create
    @fine = Fine.new(fine_params)
    if @fine.save
---
INSERT INTO "fines" ("amount", "payment_status", "created_at", "updated_at", "issue_returns_id", "student_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["amount", "20.0"], ["payment_status", true], ["created_at", "2022-07-29 09:58:41.032155"], ["updated_at", "2022-07-29 09:58:41.032155"], ["issue_returns_id", nil], ["student_id", 1]]

  def show
    @fine = Fine.find(params[:id])
---
SELECT "fines".* FROM "fines" WHERE "fines"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def edit
    @fine = Fine.find(params[:id])
---
SELECT "fines".* FROM "fines" WHERE "fines"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def update
    @fine = Fine.find(params[:id])
    if @fine.update(fine_params)
---
SELECT "fines".* FROM "fines" WHERE "fines"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "fines" SET "payment_status" = $1, "updated_at" = $2 WHERE "fines"."id" = $3  [["payment_status", false], ["updated_at", "2022-08-02 07:35:52.401203"], ["id", 1]]

  def destroy
    @fines = Fine.find(params[:id])
    if @fines.destroy
---
SELECT "fines".* FROM "fines" WHERE "fines"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "fines" WHERE "fines"."id" = $1  [["id", 4]]