Rails/Library_mngmt_system/app/controllers/issue_returns_controller.rb

  def index
    @issue_returns = IssueReturn.all
---
SELECT "issue_returns".* FROM "issue_returns"

  def create
    @issue_returns = IssueReturn.new(issue_returns_params)
    if @issue_returns.save
---
INSERT INTO "issue_returns" ("issue_time", "return_time", "created_at", "updated_at", "book_id", "student_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    @issue_returns =IssueReturn.find(params[:id])
---
SELECT "issue_returns".* FROM "issue_returns" WHERE "issue_returns"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]