Rails/Library_mngmt_system/app/controllers/students_controller.rb

  def index
    if params[:search]
      @student = Student.where('lower(name) LIKE ?', "%#{params[:search].downcase}%").paginate(page: params[:page], per_page: 3)
    else
      @student = Student.all.paginate(page: params[:page], per_page: 3)
---
SELECT "students".* FROM "students" WHERE (lower(name) LIKE '%ra%') ORDER BY "students"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "students" WHERE (lower(first_name) LIKE '%ra%')
SELECT "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("name", "phone_no", "address", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Jhanvi"], ["phone_no", "9760821085"], ["address", "Faridabad"], ["gender", nil], ["created_at", "2022-07-27 12:01:40.324305"], ["updated_at", "2022-07-27 12:01:40.324305"]]

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = $1, "phone_no" = $2, "address" = $3, "updated_at" = $4 WHERE "students"."id" = $5  [["name", "Ravi"], ["phone_no", "9818245087"], ["address", "Faridabad"], ["updated_at", "2022-07-27 11:52:15.777140"], ["id", 1]]

  def destroy
    @student = Student.find(params[:id])
    if @student.destroy
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 11]]