Rails/Assignment1/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
  def index
    users = User.all.order(:id)